-- phpMyAdmin SQL Dump
-- version 4.2.11
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2015-01-01 16:38:49
-- 服务器版本： 5.6.21
-- PHP Version: 5.6.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `liuyanban`
--

-- --------------------------------------------------------

--
-- 表的结构 `friend`
--

CREATE TABLE IF NOT EXISTS `friend` (
`fr_id` mediumint(8) unsigned NOT NULL,
  `my_name` varchar(20) NOT NULL,
  `friend_name` varchar(20) NOT NULL COMMENT '//朋友的名字',
  `fr_content` varchar(200) NOT NULL COMMENT '//验证信息',
  `fr_state` char(1) NOT NULL DEFAULT '0' COMMENT '//是否通过请求',
  `fr_date` datetime NOT NULL COMMENT '//添加朋友的时间'
) ENGINE=MyISAM AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `friend`
--

INSERT INTO `friend` (`fr_id`, `my_name`, `friend_name`, `fr_content`, `fr_state`, `fr_date`) VALUES
(6, 'zhaopingping', 'chengqiang', '我非常想和你交朋友！', '1', '2014-10-07 19:54:24'),
(7, '淘金去', 'chengqiang', '我非常想和你交朋友！', '1', '2014-10-07 19:54:55'),
(5, 'chengqiang', '留言达人', '我非常想和你交朋友！', '0', '2014-10-07 19:50:38');

-- --------------------------------------------------------

--
-- 表的结构 `message`
--

CREATE TABLE IF NOT EXISTS `message` (
`me_id` mediumint(8) unsigned NOT NULL,
  `from_user` varchar(20) NOT NULL,
  `to_user` varchar(20) NOT NULL,
  `me_content` varchar(200) NOT NULL,
  `me_state` char(1) NOT NULL DEFAULT '0',
  `me_date` datetime NOT NULL
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `message`
--

INSERT INTO `message` (`me_id`, `from_user`, `to_user`, `me_content`, `me_state`, `me_date`) VALUES
(1, 'chengqiang', '淘金去', '明天来我家吃饭吧。我昨天刚刚钓了一条大鱼，过来尝尝鲜，呵呵~~', '1', '2014-10-07 20:57:40'),
(2, '淘金去', 'chengqiang', '好的，那我们约好在什么时间见面？', '0', '2014-10-08 13:59:36'),
(3, 'zhaopingping', 'chengqiang', '你是一个大坏蛋，不理你了', '1', '2014-10-08 16:51:21');

-- --------------------------------------------------------

--
-- 表的结构 `topic`
--

CREATE TABLE IF NOT EXISTS `topic` (
`top_id` mediumint(8) unsigned NOT NULL,
  `top_type` tinyint(2) NOT NULL,
  `top_title` varchar(40) NOT NULL,
  `top_content` text NOT NULL,
  `us_name` varchar(20) NOT NULL,
  `top_create_date` datetime NOT NULL COMMENT '//主题创建的日期',
  `top_readcount` int(11) NOT NULL DEFAULT '0',
  `top_replycount` int(11) NOT NULL DEFAULT '0',
  `top_nice` tinyint(1) NOT NULL DEFAULT '0',
  `top_last_access_date` datetime NOT NULL COMMENT '//主题最后被访问的时间',
  `top_last_modify_date` datetime NOT NULL COMMENT '//主题最后被修改的时间',
  `reply_for` mediumint(8) NOT NULL DEFAULT '0' COMMENT '//0表示主题，否则就是对应主题的回复'
) ENGINE=MyISAM AUTO_INCREMENT=34 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `topic`
--

INSERT INTO `topic` (`top_id`, `top_type`, `top_title`, `top_content`, `us_name`, `top_create_date`, `top_readcount`, `top_replycount`, `top_nice`, `top_last_access_date`, `top_last_modify_date`, `reply_for`) VALUES
(1, 10, '这个夏天很火！', '这个夏天很火！这个夏天很火！这个夏天很火！这个夏天很火！这个夏天很火！这个夏天很火！这个夏天很火！这个夏天很火！这个夏天很火！这个夏天很火！这个夏天很火！这个夏天很火！', 'chengqiang', '2014-10-01 22:31:29', 0, 0, 0, '2014-10-01 22:31:29', '0000-00-00 00:00:00', 0),
(8, 3, '这是我的第二个主题！', '这是我的第二个主题！这是我的第二个主题！这是我的第二个主题！这是我的第二个主题！这是我的第二个主题！这是我的第二个主题！这是我的第二个主题！这是我的第二个主题！这是我的第二个主题！这是我的第二个主题！这是我的第二个主题！这是我的第二个主题！开始修改主题', 'chengqiang', '2014-10-04 14:14:13', 23, 11, 0, '2014-10-08 16:35:58', '2014-10-07 13:29:09', 0),
(7, 2, '这是我的第一个主题！', '这是我的第一个主题！这是我的第一个主题！这是我的第一个主题！这是我的第一个主题！这是我的第一个主题！这是我的第一个主题！这是我的第一个主题！这是我的第一个主题！这是我的第一个主题！这是我的第一个主题！', 'chengqiang', '2014-10-04 14:13:05', 0, 0, 0, '2014-10-04 14:13:05', '0000-00-00 00:00:00', 0),
(9, 3, 'RE2：这是我的第二个主题！', '好无聊的，没事不要乱发这种主题，多点有意义的主题，多给大家带来快乐吧\r\n[img]qexp/1/1.gif[/img][img]qexp/2/1.gif[/img][url]http://www.baidu.com[/url]', 'zhaopingping', '2014-10-06 09:54:46', 0, 0, 0, '2014-10-06 09:54:46', '2014-10-07 13:29:09', 8),
(10, 3, 'RE2：这是我的第二个主题！', '楼上的妹妹说的没错。大家多发有意思的主题，不然以后让我们大家聊什么呢？[img]qexp/2/5.gif[/img][img]qexp/2/4.gif[/img]', '我是一只小小鸟', '2014-10-06 10:28:58', 0, 0, 0, '2014-10-06 10:28:58', '2014-10-07 13:29:09', 8),
(11, 3, 'RE2：这是我的第二个主题！', '有没有衢州的妹子，这个周末相约黄龙体育馆，游泳去啊？有兴趣的妹子赶紧留言我。或者私聊啊[img]qexp/3/10.gif[/img]', '淘金去', '2014-10-06 10:31:24', 0, 0, 0, '2014-10-06 10:31:24', '2014-10-07 13:29:09', 8),
(12, 3, 'RE2：这是我的第二个主题！', '怎么没人理我呢。哥哥我等的都不耐烦了，算了，还是自己一个人去吧[img]qexp/2/9.gif[/img]', '淘金去', '2014-10-06 11:14:17', 0, 0, 0, '2014-10-06 11:14:17', '2014-10-07 13:29:09', 8),
(13, 3, 'RE2：这是我的第二个主题！', '第三种为Linux腾出空间的方发是在被其他操作系统使用的硬盘驱动器中为Red hat linux创建一个新分区。[img]qexp/2/6.gif[/img]', 'chengqiang', '2014-10-06 12:32:46', 0, 0, 0, '2014-10-06 12:32:46', '2014-10-07 13:29:09', 8),
(14, 3, 'RE2：这是我的第二个主题！', '[img]qexp/3/5.gif[/img]\r\n[color=#f00]我是楼主，我回来了，大家还好吗[/color][url]http://www.google.cn[/url]', 'chengqiang', '2014-10-07 13:30:53', 0, 0, 0, '2014-10-07 13:30:53', '0000-00-00 00:00:00', 8),
(15, 2, '哎，好聚好散', '天下没有不散的宴席，各自珍重！[img]qexp/3/17.gif[/img]', 'zhaopingping', '2014-10-07 13:32:42', 6, 0, 0, '2014-10-07 13:32:42', '0000-00-00 00:00:00', 0),
(16, 1, '《计算机算法设计与分析(第3版)》为普通高等教育“十一五”国家级规划教材', '是计算机专业核心课程“算法设计与分析”教材。全书以算法设计策略为知识单元，系统介绍计算机算法的设计方法与分析技巧。主要内容包括：算法概述、递归与分治策略、动态规划、贪心算法、回溯法、分支限界法、随机化算法、线性规划与网络流、NP完全性理论与近似算法等。书中既涉及经典与实用算法及实例分析，又包括算法热点领域追踪。\r\n为突出教材的可读性和可用性，章首增加了学习要点提示；章末配有难易适度的习题，分为算法分析题和算法实现题两部分；配套出版了《算法设计与实验题解》；并免费提供电子课件和教学网站服务。', 'chengqiang', '2014-10-08 16:17:28', 0, 0, 0, '2014-10-08 16:17:28', '0000-00-00 00:00:00', 0),
(17, 3, 'RE2：这是我的第二个主题！', '好像没有什么人气嘛，我来啦···[img]qexp/3/8.gif[/img]', '我是一只小小鸟', '2014-10-08 16:23:15', 0, 0, 0, '2014-10-08 16:23:15', '0000-00-00 00:00:00', 8),
(18, 3, '回复7楼的chengqiang', '它的主要目的是讲授在计算机应用中常常遇到的重要的实际问题的解法，讲授设计和分析各种算法的基本原理、方法和技术。\r\n本书共12章，取材先进、内容实用、重点突出、少而精、难易适当，便于自学。全书以非数值算法为主，兼顾数值算法；串行算法和并行算法并重；在附录中介绍并行MULTPASCAL系统的使用方法，并给出一个并行程序实例。\r\n本书可供计算机、管理信息系统、应用数学和计算机数学等专业本科生、研究生作为教材使用，也可供从事计算机科学研究、计算机软件开发的工程技术人员参考。[img]picture/pic1.jpg[/img]', '我是一只小小鸟', '2014-10-08 16:24:33', 0, 0, 0, '2014-10-08 16:24:33', '0000-00-00 00:00:00', 8),
(19, 3, '回复5楼的淘金去', '看视频的看过来哦哦[img]qexp/2/6.gif[/img][img]qexp/2/5.gif[/img][img]qexp/2/9.gif[/img][flash]http://player.youku.com/player.php/sid/XNzk4NDUwNDA0/v.swf[/flash]', '我是一只小小鸟', '2014-10-08 16:26:39', 0, 0, 0, '2014-10-08 16:26:39', '0000-00-00 00:00:00', 8),
(20, 3, 'RE2：这是我的第二个主题！', '哇，这里的朋友真够意思的啊，我来分享一下我的照片[img]picture/pic2.jpg[/img][url]http://www.tmall.com[/url]', '炎日', '2014-10-08 16:30:53', 0, 0, 0, '2014-10-08 16:30:53', '0000-00-00 00:00:00', 8),
(21, 3, '回复10楼的我是一只小小鸟', '[img]picture/pic6.jpg[/img]\r\n美人一枚[img]qexp/3/10.gif[/img][url]http://www.baidu.com[/url]', '炎日', '2014-10-08 16:35:58', 0, 0, 0, '2014-10-08 16:35:58', '0000-00-00 00:00:00', 8),
(22, 10, '诺贝尔物理学奖是根据诺贝尔的遗嘱而设立的，是诺贝尔奖之一', '简介\r\n编辑\r\n\r\n诺贝尔奖是以瑞典著名化学家、硝化甘油炸药发明人阿尔弗雷德·贝恩哈德·诺贝尔的部分遗产作为基金创立的，诺贝尔奖包括金质奖章、证书和奖金支票。在遗嘱中他提出，将部分遗产（920万美元）作为基金，以其利息分设物理、化学、生理或医学、文学及和平（后添加了‘经济’奖）5种奖金，授予世界各国在这些领域对人类做出重大贡献的学者。\r\n由来\r\n\r\n诺贝尔生于瑞典的斯德哥尔摩，诺贝尔一生致力于炸药的研究，在硝化甘油的研究方面取得了重大成就。他不仅从事理论研究，而且进行工业实践。他一生共获得技术发明专利355项，并在欧美等五大洲20个国家开设了约100家公司和工厂，积累了巨额财富。\r\n1896年12月10日，诺贝尔在意大利逝世。逝世的前一年，他留下了遗嘱，设立诺贝尔奖。据此，1900年6月瑞典政府批准设置了诺贝尔基金会，并于次年诺贝尔逝世5周年纪念日，即1901年12月10日首次颁发诺贝尔奖。自此以后，除因战时中断外，每年的这一天分别在瑞典首都斯德哥尔摩和挪威首都奥斯陆举行隆重授奖仪式。\r\n1968年瑞典中央银行于建行300周年之际，提供资金增设诺贝尔经济奖（全称为瑞典中央银行纪念阿尔弗雷德·伯恩德·诺贝尔经济科学奖金，亦称纪念诺贝尔经济学奖，并于1969年开始与其他5项奖同时颁发。诺贝尔经济学奖的评选原则是授予在经济科学研究领域作出有重大价值贡献的人，并优先奖励那些早期作出重大贡献者。\r\n1990年诺贝尔的一位重侄孙克劳斯·诺贝尔又提出增设诺贝尔地球奖，授予杰出的环境成就获得者。该奖于1991年6月5日世界环境日之际首次颁发。\r\n颁奖时间\r\n\r\n每次诺贝尔奖的发奖仪式都是下午举行，这是因为诺贝尔是1896年12月10日下午4:30去世的。为了纪念这位对人类进步和文明作出过重大贡献的科学家，在1901年第一次颁奖时，人们便选择在诺贝尔逝世的时刻举行仪式。这一有特殊意义的做法一直沿袭到如今。\r\n奖金奖章\r\n\r\n诺贝尔奖的奖金数视基金会的收入而定，其范围约从11000英镑（31000美元）到30000英镑（72000美元）。奖金的面值，由于通货膨胀，逐年有所提高，最初约为3万多美元，60年代为7.5万美元，80年代达22万多美元。金质奖章约重半镑，内含黄金23K，奖章直径约为6.5厘米，正面是诺贝尔的浮雕像。不同奖项、奖章的背面饰物不同。每份获奖证书的设计也各具风采。颁奖仪式隆重而简朴，每年出席的人数限于1500人到1800人；男士燕尾服或民族服装，女士要穿严肃的夜礼服；仪式中的所用白花和黄花必须从圣莫雷空运来，这意味着对诺贝尔的纪念和尊重。（因为圣莫雷是诺贝尔逝世的地方）。\r\n评选过程\r\n\r\n每年9月至次年1月31日，接受各项诺贝尔奖推荐的候选人。通常每年推荐的候选人有1000— 2000人。\r\n具有推荐候选人资格的有：先前的诺贝尔奖获得者、诺贝尔奖评委会委员、特别指定的大学教授、诺贝尔奖评委会特邀教授、作家协会主席（文学奖）、国际性会议和组织（和平奖）。\r\n不得自荐。\r\n瑞典政府和挪威政府无权干涉诺贝尔奖的评选工作，不能表示支持或反对被推荐的候选人。\r\n每年2月1日起，各项诺贝尔奖评委会对推荐的候选人进行筛选、审定，工作情况严加保密。\r\n每年10月中旬，公布各项诺贝尔奖获得者名单。\r\n每年12月10日是诺贝尔逝世纪念日，在斯德哥尔摩和奥斯陆分别隆重举行诺贝尔奖颁发仪式，瑞典国王出席并授奖。', 'chengqiang', '2014-10-08 16:39:02', 0, 0, 0, '2014-10-08 16:39:02', '0000-00-00 00:00:00', 0),
(23, 3, '我想问下苹果内存其他怎么删除？我已经10G的其他了', '望好心人解答。。[img]qexp/2/2.gif[/img]', 'chengqiang', '2014-10-08 16:41:39', 0, 0, 0, '2014-10-08 16:41:39', '0000-00-00 00:00:00', 0),
(24, 1, '浙江工业大学研究生院', '浙江工业大学简介\r\n编辑\r\n\r\n浙江工业大学始建于1953年，其前身可以追溯到1910年创立的浙江中等工业学堂，先后经历了杭州化工学校，浙江化工专科学校、浙江化工学院、浙江工学院和浙江工业大学等发展阶段。浙江省经济管理干部学院、杭州船舶工业学校、浙江建材工业学校分别于1994年、1999年和2001年并入浙江工业大学。\r\n2009年6月8日，浙江省和教育部签订共建协议，浙江工业大学进入省部共建高校行列。学科涵盖理、工、文、法、农、哲学、经济、医药、管理、教育、艺术十一大门类,可在理、工、文、法、医、农、哲、经济、教育、管理、艺术等十一个学科门类授予学术型学位。', 'chengqiang', '2014-10-08 16:42:47', 0, 0, 0, '2014-10-08 16:42:47', '0000-00-00 00:00:00', 0),
(25, 13, '今年“十一”国庆节放假安排，姗姗来迟啊', '2014年“十一”国庆节放假安排：10月1日至10月7日共放假7天；但9月28日（星期日）和10月11日（星期六）上班不休息。\r\n高速免费具体时间是10月1日零时至10月7日晚上24时为止（以车辆驶出高速道口时间为准）', 'chengqiang', '2014-10-08 16:44:48', 0, 0, 0, '2014-10-08 16:44:48', '2014-10-08 16:49:08', 0),
(26, 1, '夕阳，傍晚的太阳。由于接近黄昏时，太阳通常为橙红色', '寓意：\r\n1、指山的西面。《诗·大雅·公刘》：“度其夕阳，豳居允荒。”毛传：“山西曰夕阳。”《释名·释山》：“山东曰朝阳，山西曰夕阳，随日所照而名之也。”\r\n2、傍晚的太阳。晋庾阐《狭室赋》：“南羲炽暑，夕阳傍照。”宋欧阳修《醉翁亭记》：“已而夕阳在山，人影散乱，太守归而宾客从也。”《三侠五义》第二回：“正遇着深秋景况，夕阳在山之时。”冰心《寄小读者》二二：“每天黄昏独自走到山顶看日落，看夕阳自戚叩落亚的最高峰尖下坠，其红如火！”\r\n3、比喻晚年。晋刘琨《重赠卢谌》诗：“功业未及建，夕阳忽西流。”李周翰注：“夕阳，谓晚景，喻己之老也。”唐杜甫《上白帝城》诗：“老去闻悲角，人扶报夕阳。”唐白居易《秦中吟》：“朝露贪名利，夕阳忧子孙。”', 'chengqiang', '2014-10-08 16:45:58', 0, 0, 0, '2014-10-08 16:45:58', '0000-00-00 00:00:00', 0),
(27, 6, '食人树广义指地球上的食肉类植物，有13科20属600多种。', '已知的最大肉食植物是王侯猪笼草（Nepenthes rajah），会捕食小型哺乳动物。同时食人树指不同传说中的食肉植物，其体型庞大得能够杀死甚至吞噬一个人类或其它大型动物。纵使有着各种不能肯定的有关报告记载，目前为止没有此类植物的具体存在证据，因此这种植物的存在暂时还是个谜。', 'chengqiang', '2014-10-08 16:47:02', 0, 0, 0, '2014-10-08 16:47:02', '2014-10-08 16:48:55', 0),
(28, 5, '《母亲，爱情的限度》是2004年克理斯多夫·何内执导的一部备受争议的18禁作品', '本片惊世骇俗的程度，据说让开明的戛纳影展也不得不在最后一刻拉下本片，拒绝放映。作家出身的导演何内改编了巴代耶的小说，母亲不愿意让离开多时又再回到身边的17岁儿子，活在孺慕母爱的假象中，却为他开启通往性的狂喜、沉沦与毁灭的地狱之门。沉沦性海的母亲导引儿子展开一场性爱游戏，母亲于儿子内在心理和表面行为的交错展示了母子之间的爱恋和欲望交织的感情，儿子企图追寻对母亲的性爱的侵略，母亲则在与儿子之间的性欲的灰烬中选择结束自己的生命来惩罚，留下惶恐无助的儿子。\r\n\r\n当一个母亲称自己的儿子为“Lover”时，人类几千年的道德价值瞬间崩溃。上帝从云端跌落进地狱。\r\n只知道艺术在法国是自由的，但我不知道自由在这里有没有尺度。艺术是不是可以肆无忌惮的表现任何东西，比如乱伦，变态等等。好像这个问题现在已经不成问题了，近几年来的几部法国电影仿佛越来越在向世界各国人们昭示着法国人的自由，从在柏林电影节获奖的《亲密》到嘎那电影节评审团大奖的《钢琴教师》到那部所谓的女性电影法国版的《悲情城市》到去年的 《地狱解剖》，艺术的尺度在这里愈拓愈宽，直逼得道德尺度几近于无。\r\n初中时候，在语文课上老师告诉我们，可以从事物的反面来表现事物的正面，通过惩恶来达到扬善的目的，通过表现人性中阴暗的东西来反映人性中光辉的东西。我没有尝试过，所以我的作文成绩总是不好不坏。考上大学之后，我的眼界豁然开朗，看到了许多“艺术”佳作，其中包括吃死婴，或将自己的生殖器摆成各种造型，拍摄下来，供观众欣赏，或者当众撒尿，然后再喝掉。每当看到这样的艺术品时，我就觉得自己象一个外星人。\r\n于是很佩服星爷的那句话：“地球上很危险，你还是回火星上去吧！”\r\n说了这么多，其实我是想说说一部电影——《母亲，爱情的限度》。在这部影片里，母亲称自己的儿子为“Lover”，母亲和儿子大玩SM，最后母亲被玩死了，儿子在母亲的尸体前自慰。在表现这些场面时，镜头层层逼进，毫不避讳。道德的底线则节节败退。\r\n第一次详细的了解到“恋母情结”这个词的含义，是在弗洛伊德写的那本《释梦》里，当时我读大一，以当时我的知识水平，显然看不懂这位心理学大师的这本巨著，（当然，现在也还是看不懂，）充其量只是满足我得猎奇心理而已。\r\n我当时看那本书的原因，说起来也很奇怪，因为那一阵子我一直在一个梦，梦里我掉进海里，不断的下沉，所以才会找到那本《释梦》的书来看。可惜，在大师的这本《释梦》里我没有找到答案。看完那本厚厚的书，我对弗洛伊德唯一的认识就是：这是一个能把任何事都跟性联系到一起的大师。后来我听说很多人都做过这样的梦，我的同学里也有人做过，他们也听说我看过《释梦》那本书，就问我那梦到底是什么意思？我想了想说，按照弗大师的逻辑对他们说“我们都是深陷欲海的人，回头是岸吧。”\r\n“每个女孩在潜意识里都有和自己父亲做爱的冲动，每个男孩在潜意识里也都有和自己母亲做爱的冲动。”', 'chengqiang', '2014-10-08 16:48:29', 12, 0, 0, '2014-10-08 16:48:29', '0000-00-00 00:00:00', 0),
(29, 1, '闪讯账号怎么注册啊？', '在官网注册不了啊……edu到期，又想换闪讯，但是没有账号，同学们都是买手机赠的账号，难道我这也要买手机？', '张怡静', '2015-01-01 22:49:53', 0, 0, 0, '2015-01-01 22:49:53', '0000-00-00 00:00:00', 0),
(30, 2, '喜欢一个女生，但被她烦，肿么办', '喜欢一个女生，但被她烦，肿么办', '张怡静', '2015-01-01 23:01:53', 0, 0, 0, '2015-01-01 23:01:53', '0000-00-00 00:00:00', 0),
(31, 11, '毕业选择：考研or工作？', '想听听大家的毕业安排，考研，考公，还是直接实习然后工作？即使现在还是大一大二，早点设定目标会比较好！\r\n\r\n本人大三了，对未来依然没什么清晰的规划，觉得茫然又恐慌……\r\n身边有些同学从大一就有了清晰的目标和规划，并开始做准备，现在很后悔没有早点给自己确定目标，现在才会急躁恐慌……', '张怡静', '2015-01-01 23:03:01', 0, 2, 0, '2015-01-01 23:29:08', '0000-00-00 00:00:00', 0),
(32, 11, 'RE2：毕业选择：考研or工作？', '这是一条回复啦啦啦啦啦', '张怡静', '2015-01-01 23:28:15', 0, 0, 0, '2015-01-01 23:28:15', '0000-00-00 00:00:00', 31),
(33, 11, 'RE2：毕业选择：考研or工作？', '这是第二条回复啦啦啦', '张怡静', '2015-01-01 23:29:08', 0, 0, 0, '2015-01-01 23:29:08', '0000-00-00 00:00:00', 31);

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE IF NOT EXISTS `user` (
`us_id` mediumint(8) unsigned NOT NULL,
  `us_uniqid` char(40) NOT NULL,
  `us_active` char(40) NOT NULL,
  `us_level` char(1) NOT NULL DEFAULT '0' COMMENT '//管理员为1',
  `us_name` varchar(20) NOT NULL,
  `us_password` char(40) NOT NULL,
  `us_question` varchar(20) NOT NULL,
  `us_answer` char(40) NOT NULL,
  `us_sex` char(1) NOT NULL,
  `us_face` char(12) NOT NULL,
  `us_email` varchar(40) NOT NULL,
  `us_reg_time` datetime NOT NULL COMMENT '//注册时间',
  `us_login_time` datetime NOT NULL COMMENT '//本次登录系统的时间',
  `us_last_ip` varchar(20) NOT NULL COMMENT '//上一次登录时的ip地址',
  `last_wtopic_time` varchar(20) NOT NULL DEFAULT '0' COMMENT '//上一次创建主题的时间戳',
  `last_reply_time` varchar(20) NOT NULL DEFAULT '0' COMMENT '//上一次留言主题的时间戳',
  `last_read_time` varchar(20) NOT NULL DEFAULT '0' COMMENT '//上一次浏览主题的时间戳'
) ENGINE=MyISAM AUTO_INCREMENT=28 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`us_id`, `us_uniqid`, `us_active`, `us_level`, `us_name`, `us_password`, `us_question`, `us_answer`, `us_sex`, `us_face`, `us_email`, `us_reg_time`, `us_login_time`, `us_last_ip`, `last_wtopic_time`, `last_reply_time`, `last_read_time`) VALUES
(6, 'efd9f8fcdb4d045f0a28272ed4b1372854da1da5', '', '1', 'chengqiang', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我家的屁屁', '6f1585ae68b02a0b215f760ff2733cec8e73cdbd', '男', 'face/m27.jpg', '1451334907@qq.com', '2014-09-28 17:19:45', '2015-01-01 18:42:50', '127.0.0.1', '1412758109.07', '2014-10-07 13:30:53', '2015-01-01 18:45:43'),
(7, '89aee58d81354318d440487856ed17fb81ce8632', '', '0', 'zhaopingping', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我的包包是什么颜色的？', 'c0f8347c65ef39fedf944ad5907c78ec6a99ffe2', '女', 'face/m24.jpg', '123456789@qq.com', '2014-09-28 17:27:29', '2014-10-08 16:50:48', '127.0.0.1', '1412659962.61', '2014-10-06 09:54:47', '2014-10-07 13:32:45'),
(8, 'a4d67eddcf7865fb0d05f75b8bebb1ce371da89f', 'da6c7e2bef309f3e0c65abec663658559f2c2e8c', '0', 'chengxi', '7c4a8d09ca3762af61e59520943dc26494f8941b', '男孩还是女孩？', '9690a0902a432cb51ab282fe8b7dd88c7f7ffa4f', '男', 'face/m31.jpg', '1451334900@qq.com', '2014-09-30 11:18:12', '2014-09-30 11:18:12', '127.0.0.1', '0', '0', '0'),
(9, '8df60c8971c7310cf557b81900f054d12b2e704d', '', '0', '程强', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我的英文名叫什么？', 'cf7189a21441f1693b898d44a3608b0c2449f57d', '男', 'face/m38.jpg', '1451334907@qq.com', '2014-09-30 11:36:02', '2014-09-30 11:36:02', '127.0.0.1', '0', '0', '0'),
(10, 'ab23cb34ca4b9de75715317624e4fce73a9ccc94', '', '0', '赵萍萍', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我是宇宙无敌赵皮皮', '6f1585ae68b02a0b215f760ff2733cec8e73cdbd', '女', 'face/m64.jpg', '123456789@qq.com', '2014-09-30 13:42:31', '2014-09-30 13:42:31', '127.0.0.1', '0', '0', '0'),
(11, 'b099869871eb982eedcca8b4fd9384b3006de0f0', '', '0', '炎日', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我的英文名叫什么？', 'b9e896e3caf9ffe334ee0d086552ccb8e1697c73', '男', 'face/m28.jpg', '123456789@qq.com', '2014-09-30 14:03:07', '2014-10-08 16:27:20', '127.0.0.1', '0', '2014-10-08 16:35:58', '2014-10-08 16:36:06'),
(12, '38d7aa04b81eb8be7fe772968d832c93088cb681', '', '0', '我是一只小小鸟', '7c4a8d09ca3762af61e59520943dc26494f8941b', '男孩还是女孩？', '4bc66a69aac44b980dd39b65e16b08652e4433fa', '男', 'face/m03.jpg', '1451334900@qq.com', '2014-09-30 14:49:15', '2014-10-08 16:22:20', '127.0.0.1', '0', '2014-10-08 16:26:39', '2014-10-08 16:26:40'),
(13, 'df04a62966b55bc3c214d08d8a7cdc45ef6bc741', '', '0', '张三', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我是谁？', 'ced07fb42b05a2ed9efa330250e2bb9175f962ce', '男', 'face/m02.jpg', 'zhangsan@163.com', '2014-10-04 10:16:37', '2014-10-04 10:16:37', '127.0.0.1', '0', '0', '0'),
(14, 'e4d52fb4833584aa16114dbb3572ecf6fc6a4cb0', '', '0', '李四', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我的名字叫什么', 'b7b286678338a2092572733e23236485d166c0df', '男', 'face/m29.jpg', '123456789@qq.com', '2014-10-04 10:18:04', '2014-10-04 10:18:04', '127.0.0.1', '0', '0', '0'),
(15, '0e261b0534a87ce7dde08857d46c10662b272200', '', '0', '王五', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我的中文名字', '0a405ab3dcf64a6ebe449fcbd44722f693668aba', '男', 'face/m44.jpg', '123456789@qq.com', '2014-10-04 10:18:55', '2014-10-04 10:18:55', '127.0.0.1', '0', '0', '0'),
(16, '4d5ba82f1bf4a7d9241ab575ee95bcae75dca70b', '', '0', '赵六', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我的英文名叫什么？', '3cdf30811ff66c4e8776f6194553a1398cc5304b', '男', 'face/m47.jpg', 'zhaoliu@139.com', '2014-10-04 10:19:53', '2014-10-04 10:19:53', '127.0.0.1', '0', '0', '0'),
(17, 'e1d3eb154fb8161f97301a7703dba0af479b6634', '', '0', '孔夫子', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我是谁？', '3a67963555199114cf6b8ff10910ff88becfe1e5', '男', 'face/m56.jpg', 'kongfuzi@163.com', '2014-10-04 10:20:57', '2014-10-04 10:20:57', '127.0.0.1', '0', '0', '0'),
(18, 'f18aa88d4d5569e049e99630ef6b5096fd2edb3b', '', '0', 'mayun', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我是谁？', '11dd302d58f635d7ca6ea192f4d423cbf1b29c8e', '男', 'face/m57.jpg', 'mayun@sina.com', '2014-10-04 10:22:25', '2014-10-04 10:22:25', '127.0.0.1', '0', '0', '0'),
(19, '3e1de63ac236b22a0257e075ed1e0dbfc387c31c', '', '0', '周鸿祎', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我的英文名叫什么？', '7c87b83748ae3d88f7006577be9ce1867ac5e676', '男', 'face/m15.jpg', 'zhouhongyi@360.com', '2014-10-04 10:23:40', '2014-10-04 10:23:40', '127.0.0.1', '0', '0', '0'),
(20, '21df43a31d72d663045e1e040951dc7bffda5a70', '', '0', '百度', '7c4a8d09ca3762af61e59520943dc26494f8941b', '创始人', '24e00b4659f1416f9980de6090d09c1564a81273', '男', 'face/m08.jpg', 'baidu@163.com', '2014-10-04 10:24:38', '2014-10-04 10:24:38', '127.0.0.1', '0', '0', '0'),
(21, 'e63142665b10525ad2a62a4f46262c236c05b3b6', '', '0', '大师兄', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我是谁？', '38cb71aa7661b9731813c568a20a5308bc9250b3', '男', 'face/m51.jpg', 'sunwukong@qq.com', '2014-10-04 10:26:04', '2014-10-04 10:26:04', '127.0.0.1', '0', '0', '0'),
(22, '8b999b0cf3f4f41aca57722b56910b449b67ff21', '', '0', '留言达人', '7c4a8d09ca3762af61e59520943dc26494f8941b', '男孩还是女孩？', '4c89b501c491268b2252bc1321136fc4f854c9f0', '女', 'face/m09.jpg', '123456789@qq.com', '2014-10-04 10:27:11', '2014-10-04 10:27:11', '127.0.0.1', '0', '0', '0'),
(23, 'd70b63b7f02799cafbc2b102409a91798b69a343', '', '0', '研究僧', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我的英文名叫什么？', '72650a12035ee7c7e090b1b95773b7333210b2e2', '男', 'face/m41.jpg', '123456789@qq.com', '2014-10-05 15:17:39', '2014-10-05 15:17:39', '127.0.0.1', '0', '0', '0'),
(24, '80cd12b6a7c0d127220b458a0b27c23144ca55a1', '', '0', '苹果控', '7c4a8d09ca3762af61e59520943dc26494f8941b', '创始人', 'a97925cd613f79232492f9d6f87c402debe9f8db', '男', 'face/m12.jpg', '123456789@qq.com', '2014-10-05 15:20:06', '2014-10-05 15:20:06', '127.0.0.1', '0', '0', '0'),
(25, '3adb30be4d510190bf145cba24103d195d6ef5e8', '', '0', '周末老子不上班', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我是谁？', 'fc8c3cd57c581492edd3fa75b43b85b1cd268703', '女', 'face/m54.jpg', '123456789@qq.com', '2014-10-05 15:22:22', '2014-10-05 15:22:22', '127.0.0.1', '0', '0', '0'),
(26, '9ab1b5e6ac18754bae24ef6049a3c78f4e3339a8', '', '0', '淘金去', '7c4a8d09ca3762af61e59520943dc26494f8941b', '我的最爱', 'a97925cd613f79232492f9d6f87c402debe9f8db', '女', 'face/m55.jpg', '1451334907@qq.com', '2014-10-05 15:28:58', '2014-10-08 13:39:34', '127.0.0.1', '0', '2014-10-06 11:14:17', '1412564428.65'),
(27, '813d864a0b218862ce664b35b60618a08b2e0b6c', '', '0', '张怡静', '7c222fb2927d828af22f592134e8932480637c0d', '哈哈', 'e0c2ffebc31dd95054d97155c591be4a0d859620', '女', 'face/m65.jpg', 'Cathy.ZH@foxmail.com', '2015-01-01 22:11:32', '2015-01-01 23:26:46', '::1', '1420124581.445', '2015-01-01 23:29:08', '2015-01-01 23:30:04');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `friend`
--
ALTER TABLE `friend`
 ADD PRIMARY KEY (`fr_id`);

--
-- Indexes for table `message`
--
ALTER TABLE `message`
 ADD PRIMARY KEY (`me_id`);

--
-- Indexes for table `topic`
--
ALTER TABLE `topic`
 ADD PRIMARY KEY (`top_id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
 ADD PRIMARY KEY (`us_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `friend`
--
ALTER TABLE `friend`
MODIFY `fr_id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=8;
--
-- AUTO_INCREMENT for table `message`
--
ALTER TABLE `message`
MODIFY `me_id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT for table `topic`
--
ALTER TABLE `topic`
MODIFY `top_id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=34;
--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
MODIFY `us_id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=28;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
